---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.InsideDiameter
source: html/ac7e7f45-4044-acd1-f982-fac79489b0eb.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.InsideDiameter Property

The inside diameter of the pipe. Units: (ft).

## Syntax (C#)
```csharp
public double InsideDiameter { get; }
```